In [27]:
# Importing Pandas
import pandas as pd
import numpy as np

In [28]:
# Create a DataFrame from the given data
data = {
    'Name': ['Amine', 'Imene', 'Yacine', 'Sarah', 'Redha'],
    'Age': [np.nan, 30, 22, 35, 28],
    'City': ['Alger', 'Setif', 'Oran', 'Annaba', 'Jijel'],
    'Salary': [50000, 70000, 60000, 80000, 55000]
}

df = pd.DataFrame(data)
df

     Name   Age    City  Salary
0   Amine   NaN   Alger   50000
1   Imene  30.0   Setif   70000
2  Yacine  22.0    Oran   60000
3   Sarah  35.0  Annaba   80000
4   Redha  28.0   Jijel   55000

In [29]:
# 1. Display the first 3 rows of the DataFrame
first_3_rows = df.head(3)
print("1. Display the first 3 rows of the DataFrame:\n", first_3_rows)

1. Display the first 3 rows of the DataFrame:
      Name   Age   City  Salary
0   Amine   NaN  Alger   50000
1   Imene  30.0  Setif   70000
2  Yacine  22.0   Oran   60000

In [30]:
# 2. Find the number of rows and columns in the DataFrame
shape_of_df = df.shape
print("2. Find the number of rows and columns in the DataFrame:\n", shape_of_df)

2. Find the number of rows and columns in the DataFrame:
 (5, 4)

In [31]:
# 3. Display the unique values in the 'City' column
unique_cities = df["City"].unique
print("3. Display the unique values in the 'City' column:\n", unique_cities)

3. Display the unique values in the 'City' column:
 <bound method Series.unique of 0     Alger
1     Setif
2      Oran
3    Annaba
4     Jijel
Name: City, dtype: object>

In [32]:
# 4. Calculate the mean salary of the employees
mean_salary = df["Salary"].mean()
print("4. Calculate the mean salary of the employees:\n", mean_salary)

4. Calculate the mean salary of the employees:
 63000.0

In [33]:
# 5. Add a new column 'Bonus' with random bonus values (e.g., 1000, 1500, 1200, 2000, 1100)
df['Bonus'] = [1000, 1500, 1200, 2000, 1100]
print("5. Add a new column 'Bonus' with random bonus values:\n", df)

5. Add a new column 'Bonus' with random bonus values:
      Name   Age    City  Salary  Bonus
0   Amine   NaN   Alger   50000   1000
1   Imene  30.0   Setif   70000   1500
2  Yacine  22.0    Oran   60000   1200
3   Sarah  35.0  Annaba   80000   2000
4   Redha  28.0   Jijel   55000   1100

In [34]:
# 6. Drop the 'City' column from the DataFrame
df_without_city = df.drop('City', axis=1)
print("6. Drop the 'City' column from the DataFrame:\n", df_without_city)

6. Drop the 'City' column from the DataFrame:
      Name   Age  Salary  Bonus
0   Amine   NaN   50000   1000
1   Imene  30.0   70000   1500
2  Yacine  22.0   60000   1200
3   Sarah  35.0   80000   2000
4   Redha  28.0   55000   1100

In [35]:
# 7. Select only the rows where the age is greater than 25
above_25_years = df[df["Age"] > 25]
print("7. Select only the rows where the age is greater than 25:\n", above_25_years)

7. Select only the rows where the age is greater than 25:
     Name   Age    City  Salary  Bonus
1  Imene  30.0   Setif   70000   1500
3  Sarah  35.0  Annaba   80000   2000
4  Redha  28.0   Jijel   55000   1100

In [36]:
# 8. Set the 'Name' column as the index of the DataFrame
df_with_index = df.set_index('Name')
print("8. Set the 'Name' column as the index of the DataFrame:\n", df_with_index)

8. Set the 'Name' column as the index of the DataFrame:
          Age    City  Salary  Bonus
Name
Amine    NaN   Alger   50000   1000
Imene   30.0   Setif   70000   1500
Yacine  22.0    Oran   60000   1200
Sarah   35.0  Annaba   80000   2000
Redha   28.0   Jijel   55000   1100

In [37]:
# 9. Reset the index of the DataFrame
df_reset_index = df_with_index.reset_index()
print("9. Reset the index of the DataFrame:\n", df_reset_index)

9. Reset the index of the DataFrame:
      Name   Age    City  Salary  Bonus
0   Amine   NaN   Alger   50000   1000
1   Imene  30.0   Setif   70000   1500
2  Yacine  22.0    Oran   60000   1200
3   Sarah  35.0  Annaba   80000   2000
4   Redha  28.0   Jijel   55000   1100

In [38]:
# 10. Sort the DataFrame based on the 'Salary' column in descending order
sorted_df = df.sort_values('Salary', ascending=False)
print("10. Sort the DataFrame based on the 'Salary' column in descending order:\n", sorted_df)

10. Sort the DataFrame based on the 'Salary' column in descending order:
      Name   Age    City  Salary  Bonus
3   Sarah  35.0  Annaba   80000   2000
1   Imene  30.0   Setif   70000   1500
2  Yacine  22.0    Oran   60000   1200
4   Redha  28.0   Jijel   55000   1100
0   Amine   NaN   Alger   50000   1000

In [39]:
# 11. Group the DataFrame by the 'City' column and calculate the mean salary in each city
mean_salary_by_city = df.groupby('City')['Salary'].mean()
print("11. Group the DataFrame by the 'City' column and calculate the mean salary in each city:\n", mean_salary_by_city)

11. Group the DataFrame by the 'City' column and calculate the mean salary in each city:
 City
Alger     50000.0
Annaba    80000.0
Jijel     55000.0
Oran      60000.0
Setif     70000.0
Name: Salary, dtype: float64

In [40]:
# 12. Replace 'Yacine' with 'Selma' in the 'Name' column
df_replace_name = df['Name'].replace('Yacine', 'Selma')
print("12. Replace 'Yacine' with 'Selma' in the 'Name' column:\n", df_replace_name)

12. Replace 'Yacine' with 'Selma' in the 'Name' column:
 0    Amine
1    Imene
2    Selma
3    Sarah
4    Redha
Name: Name, dtype: object

In [41]:
# 13. Display the statistical summary of the DataFrame
summary_stats = df.describe()
print("13. Display the statistical summary of the DataFrame:\n", summary_stats)

13. Display the statistical summary of the DataFrame:
              Age        Salary        Bonus
count   4.000000      5.000000     5.000000
mean   28.750000  63000.000000  1360.000000
std     5.377422  12041.594579   403.732585
min    22.000000  50000.000000  1000.000000
25%    26.500000  55000.000000  1100.000000
50%    29.000000  60000.000000  1200.000000
75%    31.250000  70000.000000  1500.000000
max    35.000000  80000.000000  2000.000000

In [44]:
# 14. Fill missing values in the DataFrame with the mean of each column
df_filled_na = df.fillna(df.mean(numeric_only=True))
print("14. Fill missing values in the DataFrame with the mean of each column:\n", df_filled_na)

14. Fill missing values in the DataFrame with the mean of each column:
      Name    Age    City  Salary  Bonus
0   Amine  28.75   Alger   50000   1000
1   Imene  30.00   Setif   70000   1500
2  Yacine  22.00    Oran   60000   1200
3   Sarah  35.00  Annaba   80000   2000
4   Redha  28.00   Jijel   55000   1100

In [45]:
# 15. Calculate the total salary expenditure by the company
total_salary_expenditure = df["Salary"].sum()
print("15. Calculate the total salary expenditure by the company:\n", total_salary_expenditure)

15. Calculate the total salary expenditure by the company:
 315000

In [46]:
# 16. Save the DataFrame to a CSV file named 'employee_data.csv'
df.to_csv('employee_data.csv', index=False)
print("16. Save the DataFrame to a CSV file named 'employee_data.csv': File saved.")

16. Save the DataFrame to a CSV file named 'employee_data.csv': File saved.

In [47]:
# 17. Read the 'employee_data.csv' file into a new DataFrame
new_df = pd.read_csv('employee_data.csv')
print("17. Read the 'employee_data.csv' file into a new DataFrame:\n", new_df)

17. Read the 'employee_data.csv' file into a new DataFrame:
      Name   Age    City  Salary  Bonus
0   Amine   NaN   Alger   50000   1000
1   Imene  30.0   Setif   70000   1500
2  Yacine  22.0    Oran   60000   1200
3   Sarah  35.0  Annaba   80000   2000
4   Redha  28.0   Jijel   55000   1100

In [48]:
# 18. Display the last 2 rows of the new DataFrame
last_2_rows_new_df = new_df.tail(2)
print("18. Display the last 2 rows of the new DataFrame:\n", last_2_rows_new_df)

18. Display the last 2 rows of the new DataFrame:
     Name   Age    City  Salary  Bonus
3  Sarah  35.0  Annaba   80000   2000
4  Redha  28.0   Jijel   55000   1100

In [49]:
# 19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary'
df_renamed_columns = df.rename(columns={'Name':'EmployeeName','Age':'EmployeeAge','City':'EmployeeCity','Salary':'EmployeeSalary'})
print("19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary':\n", df_renamed_columns)

19. Rename the columns to 'EmployeeName', 'EmployeeAge', 'EmployeeCity', 'EmployeeSalary':
   EmployeeName  EmployeeAge EmployeeCity  EmployeeSalary  Bonus
0        Amine          NaN        Alger           50000   1000
1        Imene         30.0        Setif           70000   1500
2       Yacine         22.0         Oran           60000   1200
3        Sarah         35.0       Annaba           80000   2000
4        Redha         28.0        Jijel           55000   1100

In [50]:
# 20. Create a new DataFrame with only 'Name' and 'Salary' columns
df_name_salary = df[['Name', 'Salary']]
print("20. Create a new DataFrame with only 'Name' and 'Salary' columns:\n", df_name_salary)

20. Create a new DataFrame with only 'Name' and 'Salary' columns:
      Name  Salary
0   Amine   50000
1   Imene   70000
2  Yacine   60000
3   Sarah   80000
4   Redha   55000